{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "batch_normalization_132", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_132", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_132", 0, 0, {}]]]}, {"name": "max_pooling2d_17", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "batch_normalization_133", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_133", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]}, {"name": "quant_conv2d_104", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_104", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["batch_normalization_133", 0, 0, {}]]]}, {"name": "batch_normalization_134", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_134", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_104", 0, 0, {}]]]}, {"name": "add_50", "class_name": "Add", "config": {"name": "add_50", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_134", 0, 0, {}], ["batch_normalization_133", 0, 0, {}]]]}, {"name": "quant_conv2d_105", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_105", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"name": "batch_normalization_135", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_135", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_105", 0, 0, {}]]]}, {"name": "add_51", "class_name": "Add", "config": {"name": "add_51", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_135", 0, 0, {}], ["add_50", 0, 0, {}]]]}, {"name": "quant_conv2d_106", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_106", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_51", 0, 0, {}]]]}, {"name": "batch_normalization_136", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_136", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_106", 0, 0, {}]]]}, {"name": "add_52", "class_name": "Add", "config": {"name": "add_52", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_136", 0, 0, {}], ["add_51", 0, 0, {}]]]}, {"name": "quant_conv2d_107", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_107", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_52", 0, 0, {}]]]}, {"name": "batch_normalization_137", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_137", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_107", 0, 0, {}]]]}, {"name": "add_53", "class_name": "Add", "config": {"name": "add_53", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_137", 0, 0, {}], ["add_52", 0, 0, {}]]]}, {"name": "average_pooling2d_9", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_53", 0, 0, {}]]]}, {"name": "quant_conv2d_108", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_108", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_53", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_139", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_139", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_108", 0, 0, {}]]]}, {"name": "batch_normalization_138", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_138", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "add_54", "class_name": "Add", "config": {"name": "add_54", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}], ["batch_normalization_138", 0, 0, {}]]]}, {"name": "quant_conv2d_109", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_109", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_54", 0, 0, {}]]]}, {"name": "batch_normalization_140", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_140", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_109", 0, 0, {}]]]}, {"name": "add_55", "class_name": "Add", "config": {"name": "add_55", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_140", 0, 0, {}], ["add_54", 0, 0, {}]]]}, {"name": "quant_conv2d_110", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_110", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_55", 0, 0, {}]]]}, {"name": "batch_normalization_141", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_141", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_110", 0, 0, {}]]]}, {"name": "add_56", "class_name": "Add", "config": {"name": "add_56", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_141", 0, 0, {}], ["add_55", 0, 0, {}]]]}, {"name": "quant_conv2d_111", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_111", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_56", 0, 0, {}]]]}, {"name": "batch_normalization_142", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_142", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_111", 0, 0, {}]]]}, {"name": "add_57", "class_name": "Add", "config": {"name": "add_57", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_142", 0, 0, {}], ["add_56", 0, 0, {}]]]}, {"name": "average_pooling2d_10", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_57", 0, 0, {}]]]}, {"name": "quant_conv2d_112", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_112", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_57", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]]}, {"name": "batch_normalization_144", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_144", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_112", 0, 0, {}]]]}, {"name": "batch_normalization_143", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_143", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "add_58", "class_name": "Add", "config": {"name": "add_58", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_144", 0, 0, {}], ["batch_normalization_143", 0, 0, {}]]]}, {"name": "quant_conv2d_113", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_113", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_58", 0, 0, {}]]]}, {"name": "batch_normalization_145", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_145", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_113", 0, 0, {}]]]}, {"name": "add_59", "class_name": "Add", "config": {"name": "add_59", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_145", 0, 0, {}], ["add_58", 0, 0, {}]]]}, {"name": "quant_conv2d_114", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_114", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_59", 0, 0, {}]]]}, {"name": "batch_normalization_146", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_146", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_114", 0, 0, {}]]]}, {"name": "add_60", "class_name": "Add", "config": {"name": "add_60", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_146", 0, 0, {}], ["add_59", 0, 0, {}]]]}, {"name": "quant_conv2d_115", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_115", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_60", 0, 0, {}]]]}, {"name": "batch_normalization_147", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_147", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_115", 0, 0, {}]]]}, {"name": "add_61", "class_name": "Add", "config": {"name": "add_61", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_147", 0, 0, {}], ["add_60", 0, 0, {}]]]}, {"name": "average_pooling2d_11", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_11", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_61", 0, 0, {}]]]}, {"name": "quant_conv2d_116", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_116", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_61", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_149", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_149", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_116", 0, 0, {}]]]}, {"name": "batch_normalization_148", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_148", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "add_62", "class_name": "Add", "config": {"name": "add_62", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_149", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]]}, {"name": "quant_conv2d_117", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_117", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_62", 0, 0, {}]]]}, {"name": "batch_normalization_150", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_150", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_117", 0, 0, {}]]]}, {"name": "add_63", "class_name": "Add", "config": {"name": "add_63", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_150", 0, 0, {}], ["add_62", 0, 0, {}]]]}, {"name": "quant_conv2d_118", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_118", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_63", 0, 0, {}]]]}, {"name": "batch_normalization_151", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_151", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_118", 0, 0, {}]]]}, {"name": "add_64", "class_name": "Add", "config": {"name": "add_64", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_151", 0, 0, {}], ["add_63", 0, 0, {}]]]}, {"name": "quant_conv2d_119", "class_name": "QuantConv2D", "config": {"name": "quant_conv2d_119", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "WeightClip", "config": {"clip_value": 1.25}}, "bias_constraint": null, "input_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}, "kernel_quantizer": {"class_name": "SteSign", "config": {"clip_value": 1.25}}}, "inbound_nodes": [[["add_64", 0, 0, {}]]]}, {"name": "batch_normalization_152", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_152", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["quant_conv2d_119", 0, 0, {}]]]}, {"name": "add_65", "class_name": "Add", "config": {"name": "add_65", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_152", 0, 0, {}], ["add_64", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_65", 0, 0, {}]]]}, {"name": "global_average_pooling2d_4", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 1000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_average_pooling2d_4", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["dense_6", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}